/***************************************************************************\
*
*                        ************************
*                        * MINIPORT SAMPLE CODE *
*                        ************************
*
* Module Name:
*
*   perm3.h
*
* Abstract:
*
*   This module contains the definitions for the Permedia3 miniport driver.
*
* Environment:
*
*   Kernel mode
*
*
* Copyright (c) 1994-1999 3Dlabs Inc. Ltd. All rights reserved.
* Copyright (c) 1995-2002 Microsoft Corporation.  All Rights Reserved.
*
\***************************************************************************/

//
// This line will cause the DEFINE_GUID lines in i2cgpio.h actually do something
//

#define INITGUID

#include "dderror.h"
#include "devioctl.h"
#include "miniport.h"
#include "ntddvdeo.h"
#include "video.h"
#include "dmasup.h"
#include "interupt.h"

#define GAMMA_CORRECTION 1
#define MASK_OUTFIFO_ERROR_INTERRUPT 1

//
// Indicates the DX9 managed render target & z-buffer is supported
//

// #define DX9_RTZMAN 1

//
// Define an assert macro for debugging
//

#if DBG
#define PERM3_ASSERT(x, y) if (!(x)) { VideoDebugPrint((0, (y))); ASSERT(FALSE); }
#else
#define PERM3_ASSERT(x, y)
#endif

//
// Include definitions for all supported RAMDACS
//

#include "p3rd.h"

//
// We use 'Int 10' to do mode switching on the x86.
//

#if defined(i386)
    #define INT10_MODE_SET  1
#endif

//
// Default clock speed in Hz for the reference board. The actual speed

#define PCI_CTRL_BASE_INDEX       0
#define PCI_LB_BASE_INDEX         1
#define PCI_FB_BASE_INDEX         2

#define ROM_MAPPED_LENGTH       0x10000

#define VENDOR_ID_3DLABS        0x3D3D
#define PERMEDIA3_ID            0x000A
#define PERMEDIA4_ID            0x000C

//
// Capabilities flags
//
// These are private flags passed to the Permedia 3 display driver. They're
// put in the high word of the 'AttributeFlags' field of the
// 'VIDEO_MODE_INFORMATION' structure (found in 'ntddvdeo.h') passed
// to the display driver via an 'VIDEO_QUERY_AVAIL_MODES' or
// 'VIDEO_QUERY_CURRENT_MODE' IOCTL.
//
// NOTE: These definitions must match those in the Permedia 3 display driver's
//       'driver.h'!

typedef enum {
    CAPS_ZOOM_X_BY2      = 0x00000001,   // Hardware has zoomed by 2 in X
    CAPS_ZOOM_Y_BY2      = 0x00000002,   // Hardware has zoomed by 2 in Y
    CAPS_QUEUED_DMA      = 0x00000008,   // DMA address/count via the FIFO
    CAPS_LOGICAL_DMA     = 0x00000010,   // DMA through logical address table
    CAPS_USE_AGP_DMA     = 0x00000020,   // AGP DMA can be used.
    CAPS_P3RD_POINTER    = 0x00000040,   // Use the 3Dlabs P3RD RAMDAC
    CAPS_STEREO          = 0x00000080,   // Stereo mode enabled.
    CAPS_SW_POINTER      = 0x00010000,   // No hardware pointer; use software simulation
    CAPS_GLYPH_EXPAND    = 0x00020000,   // Use glyph-expand method to draw text.
    CAPS_FAST_FILL_BUG   = 0x00080000,   // chip fast fill bug exists
    CAPS_INTERRUPTS      = 0x00100000,   // interrupts supported
    CAPS_DMA_AVAILABLE   = 0x00200000,   // DMA is supported
    CAPS_DISABLE_OVERLAY = 0x00400000,   // chip do not support overlay
} CAPS;

//
// The capabilities of a Perm3 board.
//

typedef enum {
    PERM3_NOCAPS             = 0x00000000, // No additional capabilities
    PERM3_SGRAM              = 0x00000001, // SGRAM board (else SDRAM)
    PERM3_DFP                = 0x00000002, // Digital flat panel
    PERM3_DFP_MON_ATTACHED   = 0x00000010, // DFP Monitor is attached
    PERM3_USE_BYTE_DOUBLING  = 0x00000040  // Current mode requires byte-doubling
} PERM3_CAPS;

//
// Supported board definitions.
//

typedef enum _PERM3_BOARDS {
    PERMEDIA3_BOARD = 17,
} PERM3_BOARDS;

//
// Chip type definitions
//

typedef enum _PERM3_CHIPSETS {
    PERMEDIA3 = 5,
} PERM3_CHIPSET;

//
// Supported RAMDAC definitions.
//

typedef enum _PERM3_RAMDACS {
    P3RD_RAMDAC = 14,
} PERM3_RAMDACS;

//
// macros to add padding words to the structures. For the core registers we use
// the tag ids when specifying the pad. So we must multiply by 8 to get a byte
// pad. We need to add an id to make each pad field in the struct unique. The
// id is irrelevant as long as it's different from every other id used in the
// same struct.
//

#define PAD(id, n)              UCHAR   pad##id[n]
#define PADRANGE(id, n)         PAD(id, (n)-sizeof(PERM3_REG))
#define PADCORERANGE(id, n)     PADRANGE(id, (n)<<3)

//
// Perm3 registers are 32 bits wide and live on 64-bit boundaries.
//

typedef struct {
    ULONG   reg;
    ULONG   pad;
} PERM3_REG;

//
// Permedia 3 PCI Region 0 Address MAP:
//
// All registers are on 64-bit boundaries so we have to define a number of
// padding words. The number given in the comments are offsets from the start
// of the PCI region.
//

typedef struct _perm3_region0_map {

    // Control Status Registers:
    PERM3_REG       ResetStatus;                // 0000h
    PERM3_REG       IntEnable;                  // 0008h
    PERM3_REG       IntFlags;                   // 0010h
    PERM3_REG       InFIFOSpace;                // 0018h
    PERM3_REG       OutFIFOWords;               // 0020h
    PERM3_REG       DMAAddress;                 // 0028h
    PERM3_REG       DMACount;                   // 0030h
    PERM3_REG       ErrorFlags;                 // 0038h
    PERM3_REG       VClkCtl;                    // 0040h
    PERM3_REG       TestRegister;               // 0048h
    union a0 {
        // GLINT
        struct b0 {
            PERM3_REG       Aperture0;          // 0050h
            PERM3_REG       Aperture1;          // 0058h
        };
        // PERMEDIA
        struct b1 {
            PERM3_REG       ApertureOne;        // 0050h
            PERM3_REG       ApertureTwo;        // 0058h
        };
    };
    PERM3_REG       DMAControl;                 // 0060h
    PERM3_REG       DisconnectControl;          // 0068h

    // PERMEDIA only
    PERM3_REG       ChipConfig;                 // 0070h
    PERM3_REG       AGPControl;                 // 0078h - Px/Rx
    PERM3_REG       OutDMAAddress;              // 0080h
    PERM3_REG       OutDMACount;                // 0088h
    PERM3_REG       AGPTexBaseAddress;          // 0090h

    PADRANGE(201, 0xA0-0x90);
    PERM3_REG       ByDMAAddress;               // 00A0h
    PADRANGE(202, 0xB8-0xA0);

    PERM3_REG       ByDMAStride;                // 00B8h
    PERM3_REG       ByDMAMemAddr;               // 00C0h
    PERM3_REG       ByDMASize;                  // 00C8h
    PERM3_REG       ByDMAByteMask;              // 00D0h
    PERM3_REG       ByDMAControl;               // 00D8h
    PADRANGE(203, 0xE8-0xD8);

    PERM3_REG       ByDMAComplete;              // 00E8h
    PADRANGE(204, 0x100-0xE8);

    // Paged texture management registers.
    PERM3_REG        HostTextureAddress;        // 0100h
    PERM3_REG        TextureDownloadControl;    // 0108h
    PERM3_REG        TextureOperation;          // 0110h
    PERM3_REG        LogicalTexturePage;        // 0118h
    PERM3_REG        TextureDMAAddress;         // 0120h
    PERM3_REG        TextureFIFOSpace;          // 0128h
    PADRANGE(205, 0x300-0x128);

    PERM3_REG        ByAperture1Mode;           // 0300h
    PERM3_REG        ByAperture1Stride;         // 0308h
    PADRANGE(206, 0x328-0x308);

    PERM3_REG        ByAperture2Mode;           // 0328h
    PERM3_REG        ByAperture2Stride;         // 0330h
    PADRANGE(207, 0x350-0x330);

    PERM3_REG        ByDMAReadMode;             // 0350h - Px/Rx only
    PERM3_REG        ByDMAReadStride;           // 0358h - Px/Rx only
    PADRANGE(208, 0x800-0x358);

    //
    // GLINTdelta registers. Registers with the same functionality as on GLINT
    // are at the same offset. XXX are not real registers.
    //

    PERM3_REG       DeltaReset;                 // 0800h
    PERM3_REG       DeltaIntEnable;             // 0808h
    PERM3_REG       DeltaIntFlags;              // 0810h
    PERM3_REG       DeltaInFIFOSpaceXXX;        // 0818h
    PERM3_REG       DeltaOutFIFOWordsXXX;       // 0820h
    PERM3_REG       DeltaDMAAddressXXX;         // 0828h
    PERM3_REG       DeltaDMACountXXX;           // 0830h
    PERM3_REG       DeltaErrorFlags;            // 0838h
    PERM3_REG       DeltaVClkCtlXXX;            // 0840h
    PERM3_REG       DeltaTestRegister;          // 0848h
    PERM3_REG       DeltaAperture0XXX;          // 0850h
    PERM3_REG       DeltaAperture1XXX;          // 0858h
    PERM3_REG       DeltaDMAControlXXX;         // 0860h
    PERM3_REG       DeltaDisconnectControl;     // 0868h

    //
    // GLINTgamma registers
    //

    PERM3_REG        GammaChipConfig;            // 0870h
    PERM3_REG        GammaCSRAperture;           // 0878h
    PADRANGE(3, 0x0c00-0x878);
    PERM3_REG        GammaPageTableAddr;         // 0c00h
    PERM3_REG        GammaPageTableLength;       // 0c08h
    PADRANGE(301, 0x0c38-0x0c08);
    PERM3_REG        GammaDelayTimer;            // 0c38h
    PERM3_REG        GammaCommandMode;           // 0c40h
    PERM3_REG        GammaCommandIntEnable;      // 0c48h
    PERM3_REG        GammaCommandIntFlags;       // 0c50h
    PERM3_REG        GammaCommandErrorFlags;     // 0c58h
    PERM3_REG        GammaCommandStatus;         // 0c60h
    PERM3_REG        GammaCommandFaultingAddr;   // 0c68h
    PERM3_REG        GammaVertexFaultingAddr;    // 0c70h
    PADRANGE(302, 0x0c88-0x0c70);
    PERM3_REG        GammaWriteFaultingAddr;     // 0c88h
    PADRANGE(303, 0x0c98-0x0c88);
    PERM3_REG        GammaFeedbackSelectCount;   // 0c98h
    PADRANGE(304, 0x0cb8-0x0c98);
    PERM3_REG        GammaProcessorMode;         // 0cb8h
    PADRANGE(305, 0x0d00-0x0cb8);
    PERM3_REG        GammaVGAShadow;             // 0d00h
    PERM3_REG        GammaMultiGLINTAperture;    // 0d08h
    PERM3_REG        GammaMultiGLINT1;           // 0d10h
    PERM3_REG        GammaMultiGLINT2;           // 0d18h
    PADRANGE(306, 0x0f00-0x0d18);
    PERM3_REG        GammaSerialAccess;          // 0f00h
    PADRANGE(307, 0x1000-0x0f00);

    // Localbuffer Registers
    union x0 {                                   // 1000h
        PERM3_REG   LBMemoryCtl;                 // GLINT
        PERM3_REG   Reboot;                      // PERMEDIA
    };
    PERM3_REG       LBMemoryEDO;                 // 1008h
    PADRANGE(308, 0x1018-0x1008);

    // PERMEDIA3 only
    PERM3_REG       LocalMemCaps;                // 1018h
    PERM3_REG       LocalMemTiming;              // 1020h
    PERM3_REG       LocalMemControl;             // 1028h
    PERM3_REG       LocalMemRefresh;             // 1030h
    PERM3_REG       LocalMemPowerDown;           // 1038h

    // PERMEDIA & PERMEDIA2 only
    PERM3_REG       MemControl;                  // 1040h

    // PERMEDIA3 only
    PADRANGE(4, 0x1068-0x1040);
    PERM3_REG       LocalMemProfileMask0;        // 1068h
    PERM3_REG       LocalMemProfileCount0;       // 1070h
    PERM3_REG       LocalMemProfileMask1;        // 1078h

    // PERMEDIA & PERMEDIA2 only
    PERM3_REG       BootAddress;                 // 1080h   [= LocalMemProfileCount1 on PxRx]
    PADRANGE(5, 0x10C0-0x1080);
    PERM3_REG       MemConfig;                   // 10C0h
    PADRANGE(6, 0x1100-0x10C0);
    PERM3_REG       BypassWriteMask;             // 1100h
    PADRANGE(7, 0x1140-0x1100);
    PERM3_REG       FramebufferWriteMask;        // 1140h
    PADRANGE(8, 0x1180-0x1140);
    PERM3_REG       Count;                       // 1180h
    PADRANGE(9, 0x1800-0x1180);

    // Framebuffer Registers
    PERM3_REG       FBMemoryCtl;                 // 1800h
    PERM3_REG       FBModeSel;                   // 1808h
    PERM3_REG       FBGCWrMask;                  // 1810h
    PERM3_REG       FBGCColorMask;               // 1818h
    PERM3_REG       FBTXMemCtl;                  // 1820h
    PADRANGE(10, 0x2000-0x1820);

    // Graphics Core FIFO Interface
    PERM3_REG       FIFOInterface;               // 2000h
    PADRANGE(11, 0x3000-0x2000);

    // Internal Video Registers
    union x1 {
        // GLINT
        struct s1 {
            PERM3_REG   VTGHLimit;               // 3000h
            PERM3_REG   VTGHSyncStart;           // 3008h
            PERM3_REG   VTGHSyncEnd;             // 3010h
            PERM3_REG   VTGHBlankEnd;            // 3018h
            PERM3_REG   VTGVLimit;               // 3020h
            PERM3_REG   VTGVSyncStart;           // 3028h
            PERM3_REG   VTGVSyncEnd;             // 3030h
            PERM3_REG   VTGVBlankEnd;            // 3038h
            PERM3_REG   VTGHGateStart;           // 3040h
            PERM3_REG   VTGHGateEnd;             // 3048h
            PERM3_REG   VTGVGateStart;           // 3050h
            PERM3_REG   VTGVGateEnd;             // 3058h
            PERM3_REG   VTGPolarity;             // 3060h
            PERM3_REG   VTGFrameRowAddr;         // 3068h
            PERM3_REG   VTGVLineNumber;          // 3070h
            PERM3_REG   VTGSerialClk;            // 3078h
            PERM3_REG   VTGModeCtl;              // 3080h
        };
        // PERMEDIA
        struct s2 {
            PERM3_REG   ScreenBase;              // 3000h
            PERM3_REG   ScreenStride;            // 3008h
            PERM3_REG   HTotal;                  // 3010h
            PERM3_REG   HgEnd;                   // 3018h
            PERM3_REG   HbEnd;                   // 3020h
            PERM3_REG   HsStart;                 // 3028h
            PERM3_REG   HsEnd;                   // 3030h
            PERM3_REG   VTotal;                  // 3038h
            PERM3_REG   VbEnd;                   // 3040h
            PERM3_REG   VsStart;                 // 3048h
            PERM3_REG   VsEnd;                   // 3050h
            PERM3_REG   VideoControl;            // 3058h
            PERM3_REG   InterruptLine;           // 3060h
            PERM3_REG   DDCData;                 // 3068h
            PERM3_REG   LineCount;               // 3070h
            PERM3_REG   VFifoCtl;                // 3078h
            PERM3_REG   ScreenBaseRight;         // 3080h
        };
    };

    PERM3_REG   MiscControl;                     // 3088h

    PADRANGE(111, 0x3100-0x3088);

    PERM3_REG  VideoOverlayUpdate;               // 0x3100
    PERM3_REG  VideoOverlayMode;                 // 0x3108
    PERM3_REG  VideoOverlayFifoControl;          // 0x3110
    PERM3_REG  VideoOverlayIndex;                // 0x3118
    PERM3_REG  VideoOverlayBase0;                // 0x3120
    PERM3_REG  VideoOverlayBase1;                // 0x3128
    PERM3_REG  VideoOverlayBase2;                // 0x3130
    PERM3_REG  VideoOverlayStride;               // 0x3138
    PERM3_REG  VideoOverlayWidth;                // 0x3140
    PERM3_REG  VideoOverlayHeight;               // 0x3148
    PERM3_REG  VideoOverlayOrigin;               // 0x3150
    PERM3_REG  VideoOverlayShrinkXDelta;         // 0x3158
    PERM3_REG  VideoOverlayZoomXDelta;           // 0x3160
    PERM3_REG  VideoOverlayYDelta;               // 0x3168
    PERM3_REG  VideoOverlayFieldOffset;          // 0x3170
    PERM3_REG  VideoOverlayStatus;               // 0x3178

    //
    // External Video Control Registers
    // Need to cast this to a struct for a particular video generator
    //

    PADRANGE(12, 0x4000-0x3178);
    PERM3_REG       ExternalVideo;               // 4000h
    PADRANGE(13, 0x4080-0x4000);

    //
    // Mentor Dual-TX clock chip registers
    //

    PERM3_REG       MentorICDControl;            // 4080h

    //
    // for future: MentorDoubleWrite is at 40C0: 0 = single write, 1 = double
    //             NB must have 2-way interleaved memory

    PADRANGE(14, 0x4800-0x4080);

    PERM3_REG       GloriaControl;               // 4800h

    PADRANGE(15, 0x5000-0x4800);
    PERM3_REG       DemonProDWAndStatus;         // 5000h - Pro
    PADRANGE(151, 0x5800-0x5000);

    //
    // P2 video streams registers
    //

    PERM3_REG        VSConfiguration;            // 5800h
    PERM3_REG        VSStatus;                   // 5808h
    PERM3_REG        VSSerialBusControl;         // 5810h
    PADRANGE(16, 0x5A00-0x5810);
    PERM3_REG        VSBControl;                 // 5A00h
    PADRANGE(161, 0x6000-0x5A00);

    union x2 {
        struct s3 {
            PERM3_REG   RacerDoubleWrite;        // 6000h
            PERM3_REG   RacerBankSelect;         // 6008h
            PERM3_REG   DualTxVgaSwitch;         // 6010h
            PERM3_REG   DDC1ReadAddress;         // 6018h
        };
        struct s4 {

            //
            // the following array is actually 1024 bytes long
            //

            UCHAR       PermediaVgaCtrl[4*sizeof(PERM3_REG)];
        };
    };
    PADRANGE(17, 0x7000-0x6018);
    union {
        PERM3_REG       DemonProUBufB;           // 7000h - Pro
        PERM3_REG        TextureDataFifo;
    };
    PADRANGE(171, 0x8000-0x7000);

} Perm3ControlRegMap, *pPerm3ControlRegMap;

//
// Permedia 3 Interrupt Control Bits
//

// InterruptEnable register
#define INTR_DISABLE_ALL        0
#define INTR_ENABLE_DMA         (1 << 0)
#define INTR_ENABLE_SYNC        (1 << 1)
#define INTR_ENABLE_EXTERNAL    (1 << 2)
#define INTR_ENABLE_ERROR       (1 << 3)
#define INTR_ENABLE_VBLANK      (1 << 4)
#define INTR_ENABLE_GCOMMAND    (1 << 13)

// InterruptFlags register
#define INTR_DMA_SET            (1 << 0)
#define INTR_SYNC_SET           (1 << 1)
#define INTR_EXTERNAL_SET       (1 << 2)
#define INTR_ERROR_SET          (1 << 3)
#define INTR_VBLANK_SET         (1 << 4)
#define INTR_TEXTURE_FAULT_SET  (1 << 6)
#define INTR_GCOMMAND_SET       (1 << 13)

#define INTR_CLEAR_ALL          (0x1f | (1 << 13))
#define INTR_CLEAR_DMA          (1 << 0)
#define INTR_CLEAR_SYNC         (1 << 1)
